Revit 2024 API
ProjectInfo.ClientName Property
Get or Set the Client Name of the Project Information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string ClientName { get; set; }
Visual Basic
Public Property ClientName As String
	Get
	Set
Visual C++
public:
property String^ ClientName {
	String^ get ();
	void set (String^ value);
}
Remarks
This property is used to get or set the Project Client Name of the Project Information.
See Also
ProjectInfo Class
Autodesk.Revit.DB Namespace